{
  "heroes": {
    "Captain America": {
      "role": "Tank",
      "image": "photos/Captain_America.webp",
      "description": "Enhanced by the Super-Soldier Serum, Steven Rogers uses his Vibranium shield and extensive combat training to confront any threat to justice. When Captain America rallies his troops, a wave of courage sweeps across the battlefield!"
    },
    "Venom":{
      "role": "Tank",
      "image": "photos/Venom.webp",
      "description":"Using his symbiote-enhanced body as the perfect living weapon, Eddie Brock and his alien ally stand ever-ready to unleash vicious attacks upon anyone he deems an enemy. Those ensnared by Venom's tentacles have no choice but to surrender to this insatiable predator."
    },
    "Doctor Strange": {
      "role": "Tank",
      "image": "photos/Doctor_Strange.webp",
      "description": "As the Sorcerer Supreme, Doctor Stephen Strange gracefully wields ancient spells to turn the tide of even the most impossible battle. However, magic always comes at a cost, and each use of his arcane abilities gradually awakens the darkness within him."
    },
    "Black Panther": {
      "role": "FrontLine",
      "image": "photos/Black_Panther.webp",
      "description": "T'Challa, King of Wakanda, wields the perfect blend of the cutting-edge Vibranium technology and ancestral power drawn from the Panther God, Bast. The Black Panther bides his time until elegantly infiltrating enemy lines and commencing his hunt."
    },
    "Hawkeye": {
      "role":"FrontLine",
      "image": "photos/Hawkeye.webp",
      "description": "Despite his lack of superpowers, Hawkeye's unparalleled skills as a marksman have earned him a spot alongside earth's mightiest heroes. With a cool head and steady hand, Clint Barton never misses a target… so enemies best stay out of his sights!"
    },
    "Thor": {
      "role":"Tank",
      "image": "photos/Thor.webp",
      "description": "The son of Odin taps into his divine power to call forth thunder and lightning, raining down relentless fury upon his enemies. With his mighty hammer Mjolnir in hand, Thor effortlessly asserts his dominance on the field of combat."
    },
    "Groot": {
      "role":"Tank",
      "image": "photos/Groot.webp",
      "description": "A sentient tree and member of the Guardians of the Galaxy."
    },
    "Magneto": {
      "role":"Tank",
      "image": "photos/Magneto.webp",
      "description": "The Master of Magnetism bends even the strongest metal to his whims, shielding his allies and striking at his foes. Whether he calls himself Max Eisenhardt, Erik Lehnsherr, or simply Magneto, the hardships this warrior has endured have made him as unbreakable as the steel he brandishes."
    },
    "Hulk": {
      "role":"Tank",
      "image": "photos/Hulk.webp",
      "description": "Brilliant scientist Dr. Bruce Banner has finally found a way to coexist with his monstrous alter ego, the Hulk. By accumulating gamma energy over multiple transformations, he can become a wise and strong Hero Hulk or a fierce and destructive Monster Hulk – a true force of fury on the battlefield!"
    },
    "Loki": {
      "role": "Strategist",
      "image": "photos/Loki.webp",
      "description": "God of Mischief and Thor's brother."
    },
    "Hela": {
      "role":"FrontLine",
      "image": "photos/Hela.webp",
      "description": "As the Goddess of Death, Hela wields supreme control over the fallen souls residing in Hel. With a haunting whisper and a murder of crows, the queen of the underworld gracefully reaps the souls of her enemies without an ounce of mercy."
    },
    "Rocket Raccoon": {
      "role":"Strategist",
      "image": "photos/Rocket.webp",
      "description": "A genetically modified raccoon and expert marksman."
    },
    "Mantis": {
      "role":"Strategist",
      "image": "photos/Mantis.webp",
      "description": "Mantis uses her impressive mental abilities and her penchant for plant control to anchor any team she fights alongside. Her powers tap into a limitless flow of life energy, gently nourishing everything she touches."
    },
    "Black Widow":{
      "role":"FrontLine",
      "image": "photos/Widow.webp",
      "description":"Natasha Romanova is the world's most elite spy in any era. Her mastery of the sniper rifle eliminates targets from afar, while her shock batons neutralize close-range threats. Black Widow is locked, loaded, and ready to deliver a fatal bite!"
    },
    "Winter Solder":{
      "role":"FrontLine",
      "image": "photos/Winter.webp",
      "description":"Terrifying experiments turned him into a brainwashed assassin, but now James Buchanan Bucky Barnes is in control of his own fate once again. With his enhanced mechanical arm, the Winter Soldier is primed to deliver earth-shattering blows to any foe in his path!"
    },
    "Scarlet Witch":{
      "role": "FrontLine",
      "image": "photos/Witch.webp",
      "description": "Wanda Maximoff is adept at harnessing formidable chaos magic, casting hexes with the power to twist and reshape reality itself. Energy, space, and matter are mere playthings in the hands of Scarlet Witch!"
      
    },
    "Namor":{
      "role":"FrontLine",
      "image": "photos/Namor.webp",
      "description":"The unrivaled King of the Seas, Namor surfs into battle on a mighty wave with an army of fierce aquatic creatures in his wake. When ancient horns of war blare, devastation soon follows as deadly waters engulf the arena."
    },
    "Peni Parker":{
      "role":"Tank",
      "image": "photos/Parker.webp",
      "description":"Peni Parker may be young, but she bravely stands on the frontlines to protect the Web of Life and Destiny. Together, this teen prodigy and her state-of-the-art mech, the sensational SP//dr, make for the most thrilling duo on the battlefield!"
    },
    "Psylocke":{
      "role":"FrontLine",
      "image": "photos/Psylocke.webp",
      "description":"The psychic warrior known as Sai has the Mutant ability to conjure a variety of weapons with the power of her mind. Gracefully gliding across the battlefield, this trained ninja can shatter the enemy's defenses with a single thought."
    },
    "Wolverine":{
      "role":"FrontLine",
      "image": "photos/Wolverine.webp",
      "description":"Thanks to his regenerative healing factor and berserker rage, the centuries-old Logan can fight through the worst pain to go claw-to-claw with any foe. The Wolverine stands ready to shred through all obstacles in his way with his Adamantium claws."
    },
    "The Punisher":{
      "role":"FrontLine",
      "image": "photos/The_Punisher.webp",
      "description":"Expertly wielding a full arsenal of futuristic weapons, Frank Castle is a formidable one-man army. With a steadfast resolve to deliver justice to his enemies, The Punisher won't cease in his mission until every last round is fired!"
    },
    "Squirrel Girl":{
      "role":"FrontLine",
      "image": "photos/Squirrel_Girl.webp",
      "description":"Possessing only the powers of a common squirrel, somehow Doreen Green manages to defeat seemingly invincible enemies in the most unexpected ways. Any foe who counts her out is bound to fall at the hands of the Unbeatable Squirrel Girl!"
    },
    "Moon Knight":{
      "role":"FrontLine",
      "image": "photos/Moon.webp",
      "description":"As the avatar of the Egyptian God of Vengeance, Marc Spector's body has been enhanced by Khonshu himself. Bathed in a luminous aura that pierces the darkness, Moon Knight glides through the night, ready to sear his enemies with his master's sacred Ankhs."
    },
    "Magik":{
      "role":"FrontLine",
      "image": "photos/Magik.webp",
      "description":"Trained in the dark arts and wielding her mighty Soulsword, Magik leaps through portals to navigate the arena with ease. Once Illyana transforms into the demonic Darkchild, all who dare stand against her will fall before her merciless blade."
    },
    "Jeff the Land Shark":{
      "role": "Strategist",
      "image": "photos/Jeff.webp",
      "description":"Most landsharks are vicious creatures of the deep... but not Jeff! This adorable and mischievous little landshark brings splashes of joy and healing to every battle. But if the tide turns, Jeff can morph into a voracious beast, swallowing an army of foes in one giant gulp!"
    },
    "Star-Lord":{
      "role":"FrontLine",
      "image": "photos/Star-Lord.webp",
      "description":"Peter Quill lives to dazzle his foes on the battlefield with his signature swagger. As his element guns paint arcs of devastation, his acrobatic moves sail through the sky with unrivaled style. With performances this spectacular, it's no wonder that Star-Lord is so legendary!"
    }
    
  },
  "teamUps": {
    "Hawkeye – Black Widow": {
        "images": [
            "photos/Hawkeye.webp",
            "photos/Widow.webp"
        ],
        "description": "An expert archer and a master spy team up to save the world."
    },
    "Hela – Thor – Loki": {
        "images": [
            "photos/Hela.webp",
            "photos/Thor.webp",
            "photos/Loki.webp"
        ],
        "description": "Asgardian siblings with immense power, each with their own agenda."
    },
    "Hulk - Iron Man - Doctor Strange": {
      "images": [
        "photos/Hulk.webp",
        "photos/IronMan.webp",
        "photos/Doctor_Strange.webp"
      ],
      "description": "Hulk charges Doctor Strange and Iron Man with gamma radiation. When Doctor Strange uses Maelstrom of Madness, he unleashes excess gamma energy. When Iron Man uses Armor Overdrive, he will initiate a gamma upgrade."
    },
    "Rocket Raccoon - Winter Soldier - Punisher": {
      "images": [
        "photos/Rocket.webp",
        "photos/Winter.webp",
        "photos/Punisher.webp"
      ],
      "description": "Rocket Raccoon throws an Ammo Overload Device in the target direction. Upon entering the device's range, The Punisher and the Winter Soldier receive the buffs of Infinite Ammo and Faster Firing."
    },
    "Magik - Black Panther - Psylocke":{
      "images": [
        "photos/Magik.webp",
        "photos/Black_Panther.webp",
        "photos/Psylocke.webp"
      ],
      "description":"When Magik is on the field, Black Panther and Psylocke can tap into Limbo to rewind a few seconds back to a previous position; after passing through Limbo, Black Panther and Psylocke will Bonus Health based on missing health"
    },
    "Cloack & Dagger - Moon Knight":{
      "images": [
        "photos/C&D.webp",
        "photos/Moon.webp"
      ],
      "description":"Cloak & Dagger can inject light and dark energy into Moon Knight to create a Light & Dark Realm where Moon Knight can become invisible."
    },
      "Luna Snow - Namor - Jeff The land shark":{
      "images": [
        "photos/Luna.webp",
        "photos/Namor.webp",
        "photos/Jeff.webp"
      ],
      "description":"Luna Snow infuses ice energy into Namor and Jeff the Land Shark, who then can tap into the ice energy to power up abilities at will."
    },
    "Adam Warlock - Star-Lord - Mantis":{
      "images": [
        "photos/Adam.webp",
        "photos/Star-lord.webp",
        "photos/Mantis.webp"
      ],
      "description":"Adam Warlock enhances the rebirth power of Star-Lord and Mantis, granting them the power of cocooned revival."
    },
    "Hawkeye - Black Widow":{
      "images": [
        "photos/Hawkeye.webp",
        "photos/Widow.webp"
      ],
      "description":"Hawkeye can share his Hunter's Sight with Black Widow, enabling her to catch sight of and damage afterimages of enemies."
    },
    "Iron Fist - Luna":{
      "images": [
        "photos/Iron_Fist_Tile.webp",
        "photos/Luna.webp"
      ],
      "description":"Iron Fist channels the Chi of Shou-Lao into Luna Snow, transforming her ice power into a Chi-infused frosty ring that radiates from her. This ring can launch up enemies with chilling damage and applies a slowing effect, while simultaneously healing her allies."
    },
    "Spider-Man - Squirrel Girl":{
      "images": [
        "photos/Spider-Man.webp",
        "photos/Squirrel_Girl.webp"
      ],
      "description":"Spider-Man gives Squirrel Girl a web bomb. She can launch it to unleash a explosion upon contact with the environment or an enemy, briefly Immobilizing and damage enemies caught in the blast."
    },
    "Hulk - Wolverine":{
      "images": [
        "photos/Hulk.webp",
        "photos/Wolverine.webp"
      ],
      "description":"Wolverine, Hulk can interact with each other. Once both parties confirm, Hulk can lift Wolverine and press the key to hurl him forward."
    },
    "Invisble Woman - Mister Fantastic":{
      "images": [
        "photos/Invisible.webp",
        "photos/Fantastic.webp"
      ],
      "description":"The Invisible Woman taps into her powers, channeling Psionic Might to fortify the entire Fantastic Four team. This formidable force bolsters MISTER FANTASTIC, granting damage resistance. Once activated, they can continually generate Bonus Health, making up for lost Health with each passing moment."
    },
    "Thor - Captain America":{
      "images":[
        "photos/Thor.webp",
        "photos/Captain_America.webp"
      ],
      "description": "Thor gives Captain America lightning burst, so each hit from Captain America is infused with lightning doing more damage"
    }
  }
}