{
  "patches": [
    {
      "patchId": "20250110",
      "patchVersion": "20250110",
      "releaseDate": "09-01-2025",
      "title": " Balance Post –  Season 1 Begins!",
      "summary": "Summary of the patch with key highlights.",
      "heroes": {
        "Vanguard": [
          {
            "name": "Captain America",
            "changes": [
              "Reduce the delay time for shield restoration after releasing Living Legend from 3s to 2s.",
              "Reduce Liberty Rush cooldown from 12s to 10s.",
              "Increase base health from 650 to 675.",
              "Reduce the energy cost for releasing Freedom Charge (ultimate ability) from 3400 to 3100; Reduce the additional health provided per second to self after releasing it from 110 to 100."
            ]
          },
          {
            "name": "Doctor Strange",
            "changes": [
              "Add damage falloff to Maelstrom of Madness and Gamma Maelstrom. Starting at 5 meters and reducing to 70% at 8 meters.",
              "Slightly decrease the shield value recovery rate after releasing Shield of the Seraphim from 80/s to 70/s."
            ]
          }
        ],
        "Duelist": [
          {
            "name": "Black Panther",
            "changes": [
              "Reduce the additional health provided to self after refreshing Vibranium Marks with Spirit Rend from 40 to 30, and the upper limit of additional health provided from 120 to 75."
            ]
          }
        ]
      },
      "teamUpAbilities": [
        {
          "teamUp": "Hawkeye – Black Widow",
          "changes": [
            "Reduce Hawkeye's season bonus from 20% to 15%."
          ]
        },
        {
          "teamUp": "Hela – Thor – Loki",
          "changes": [
            "Reduce Hela's season bonus from 20% to 15%."
          ]
        }
      ]
    },
    {
      "patchId": "20250108",
      "patchVersion": "20250108",
      "releaseDate": "08-01-2025",
      "title": "Marvel Rivals Patch Notes",
      "summary": "Rivals, Assemble! As the light fades and the eternal night falls, Dracula and his undead legion have seized control of New York City. Before we embark on the epic battle to banish the darkness and restore the light, dive into the thrilling details of this update!",
      "content": [
        {
          "sectionTitle": "New Content",
          "content": [
            {
              "title": "Heroes and Costumes",
              "details": [
                "Mister Fantastic and the Invisible Woman join Marvel Rivals!",
                "New Costumes: Mister Fantastic - The Maker; Invisible Woman - Malice!"
              ]
            },
            {
              "title": "Maps and Modes",
              "details": [
                "Explore the new Convoy map - Empire of Eternal Night: Midtown.",
                "Prepare for the thrilling arcade mode (Doom Match) and its map (Sanctum Sanctorum): 8-12 players will engage in battle, with the top 50% emerging victorious.",
                "New feature: In Convoy and Convergence, both sides can transition to the next spawn room sometime after the attacking side completes the current target.",
                "Enhanced feature: During the loading phase of a Quick Match, you can now view the Nameplates of both sides."
              ]
            },
            {
              "title": "Season & Store",
              "details": [
                "Unlock a dazzling shiny new Battle Pass featuring 10 brand new sets of heroic costumes!",
                "Embark on the first thrilling half of the Midnight Features Season Event!",
                "Dive into the latest Twitch Drops event, featuring rewards such as the Hela - Will of Galacta costume. (Stay tuned for official announcements for specific times)",
                "We have revised the refresh times for various in-game content. Beginning with Season 1, the unlock time for daily missions, the availability of new items in the store, and the start time for most events have been adjusted from 7:00 (UTC+0) to 9:00 (UTC+0).",
                "Additionally, we have optimized the mission types and removed some of the more challenging ones."
              ]
            }
          ]
        },
        {
          "sectionTitle": "Fixes and Optimizations",
          "content": [
            {
              "title": "General",
              "details": [
                "Resolved numerous issues related to notifications.",
                "Rectified various text errors."
              ]
            },
            {
              "title": "Heroes",
              "details": [
                "Corrected minor movement ability discrepancies for certain heroes (like Doctor Strange and Magik) at both low and high frame rates.",
                "Addressed occasional malfunctions with, or inability to use Wolverine's team-up ability."
              ]
            }
          ]
        }
      ]
    },
    {
      "patchId": "20241210",
      "patchVersion": "20241210",
      "releaseDate": "10-12-2025",
      "title": "Marvel Rivals Patch Notes",
      "summary": "Greetings, Rivals! We're here to give you the scoop on Version 20241210's updates!",
      "content": [
        {
          "sectionTitle": "All Platforms",
          "content": [
            {
              "title": "General",
              "details": [
                "When playing highlights and recordings, crosshair deviation would be significant, and there was a possibility for lag. This issue has been resolved.",
                "Changing where Highlights were saved would cause the game to crash. This issue has been resolved.",
                "Players joining a Quick Match as a replacement may not be able to see heroes' equipped costumes. This issue has been resolved.",
                "Mission progress on the Season Event screen would not display correctly. This issue has been resolved.",
                "Fixed some textual errors. More fixes will be coming in a future update."
              ]
            },
            {
              "title": "Maps & Game Modes",
              "details": [
                "Special collisions on certain maps caused the player's character to become stuck or clip through and enter strange areas. These issues have been largely resolved."
              ]
            }
          ]
        }
      ]
    },
    {
      "patchId": "20241219",
      "patchVersion": "20241219",
      "releaseDate": "19-12-2024",
      "title": "Marvel Rivals Winter Celebration Patch Notes",
      "summary": "Dear Rivals: Get ready to embrace the chill and welcome the holiday season with the first Special Event of Marvel Rivals!",
      "content": [
        {
          "sectionTitle": "Special Event—Winter Celebration",
          "content": [
            {
              "title": "Dive into the frosty festivities",
              "details": [
                "Join the fun and earn the Jeff the Land Shark - Cuddly Fuzzlefin series costume rewards completely for FREE!",
                "Event Duration: 2024/12/20 07:00:00 ~ 2025/01/09 15:59:59 (UTC+0)"
              ]
            }
          ]
        },
        {
          "sectionTitle": "New Mode—Jeff's Winter Splash Festival",
          "content": [
            {
              "title": "Winter? Snow? It's Jeff!",
              "details": [
                "Take control of Jeff the Land Shark and spray snowflakes to transform the garden of Yggsgard: Royal Palace into a winter wonderland."
              ]
            }
          ]
        },
        {
          "sectionTitle": "Commemorative Gallery Card—Season's Beatings!",
          "content": [
            {
              "title": "Craft your personalized winter greeting card",
              "details": [
                "Complete missions to earn Golden and Silver Frost.",
                "Unlock and upgrade a dazzling array of greeting card decorations."
              ]
            }
          ]
        },
        {
          "sectionTitle": "New Costumes—Winter Holiday Series",
          "content": [
            {
              "title": "Celebrate the season with themed costumes",
              "details": [
                "Jeff the Land Shark - Cuddly Fuzzlefin (Free during the 'Winter Celebration' event)",
                "Groot - Holiday Happiness (Available 2024/12/20 to 2025/01/10 UTC+0)",
                "Rocket Raccoon - Wild Winter (Available 2024/12/20 to 2025/01/10 UTC+0)",
                "Venom - Snow Symbiote (Available 2024/12/27 to 2025/01/17 UTC+0)",
                "Magik - Frozen Demon (Available 2024/12/27 to 2025/01/17 UTC+0)"
              ]
            }
          ]
        },
        {
          "sectionTitle": "Bug Fixes",
          "content": [
            {
              "title": "All Platforms—General",
              "details": [
                "Fixed the Double-Elimination Tournament Display issue.",
                "Resolved the Tournament Exit Glitch.",
                "Fixed issues related to historical faction access after tournaments.",
                "Squirrel Girl achievement now properly counts enemy KOs.",
                "Partially resolved network stability issues under poor conditions."
              ]
            },
            {
              "title": "Maps and Gameplay",
              "details": [
                "Resolved character collision issues on some maps.",
                "Corrected vehicle performance in special convoy missions."
              ]
            },
            {
              "title": "Hero Bug Fixes",
              "details": [
                "Doctor Strange's portal KOs are functioning correctly again.",
                "Fixed Winter Soldier's movement speed issues after using his ultimate.",
                "Rocket Raccoon's jet pack issues have been resolved.",
                "Venom's 'Cyan Clash' emote texture corrected.",
                "Star-Lord's low gravity glitch resolved.",
                "Fixed terrain KO issues with Jeff the Land Shark's ultimate."
              ]
            }
          ]
        },
        {
          "sectionTitle": "Console",
          "content": [
            {
              "title": "Memory Mastery",
              "details": [
                "Optimized console memory management to prevent crashes."
              ]
            }
          ]
        }
      ]
    }
    
  ]
}
